### 데이터프래임 연산 -2
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- DataFrame과 DataFrame 연산 수행

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
data={'A':[98,78,100,52],
    'B': [90,70,20,60]}

In [5]:
# [3] DataFrame으로 저장
df1= pd.DataFrame(data)
df2=df1/4
df1, df2

(     A   B
 0   98  90
 1   78  70
 2  100  20
 3   52  60,
       A     B
 0  24.5  22.5
 1  19.5  17.5
 2  25.0   5.0
 3  13.0  15.0)

In [6]:
# [4] 연산수행
# -산술연산
df1-df2           #일대일 대응으로 연산

      A     B
0  73.5  67.5
1  58.5  52.5
2  75.0  15.0
3  39.0  45.0

In [7]:
#비교연산
df1!=df2

      A     B
0  True  True
1  True  True
2  True  True
3  True  True

In [10]:
# [5]DataFrame과 Series 연산
# A 컬럼만 추출
sr1=df1.A   #컬럼의 차이가 존재->각각의 인덱스에 맞는 값이 없음(대응되는 값이 없음)
df2+sr1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [11]:
# [방법1] Dataframe으로 변환
srdf= sr1.to_frame()
srdf

     A
0   98
1   78
2  100
3   52

In [14]:
df1+srdf
df1.add(srdf, fill_value=0)

     A     B
0  196  90.0
1  156  70.0
2  200  20.0
3  104  60.0

In [18]:
df1.columns=[0,1]
sr1, df1+sr1.T, df1.T+sr1

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
      0    1   2   3
 0  196  168 NaN NaN
 1  176  148 NaN NaN
 2  198   98 NaN NaN
 3  150  138 NaN NaN,
      0    1    2    3
 0  196  156  200  104
 1  188  148  120  112)